# ThinLinesOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ThinLinesOptions Class
Members See Also
---
A utility class containing setting related to the Thin Lines option which affects the display in the UI.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015 Subscription Update
# Syntax
C#
---
```text
public class ThinLinesOptions : IDisposable
```

Visual Basic
---
```text
Public Class ThinLinesOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ThinLinesOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..ThinLinesOptions
# See Also
ThinLinesOptions Members
Autodesk.Revit.UI Namespace